In [1]:
#concat, esta técnica se centra en bases de datos comúnes, es decir, tienen las mismas columnas

In [2]:
import pandas as pd

In [19]:
df= pd.DataFrame({"A":["1A","2A"],"B": ["1B","2B"],"C":["1C","2C"]})
df2=pd.DataFrame({"A":["6A","7A","8A"],"B": ["6B","7B","8B"],"C":["6C","7C","8C"]})

In [20]:
df

    A   B   C
0  1A  1B  1C
1  2A  2B  2C

In [21]:
df2

    A   B   C
0  6A  6B  6C
1  7A  7B  7C
2  8A  8B  8C

In [22]:
pd.concat([df,df2], ignore_index=True)# se ignora index para que se etiquete desde 0 en orden

    A   B   C
0  1A  1B  1C
1  2A  2B  2C
2  6A  6B  6C
3  7A  7B  7C
4  8A  8B  8C

In [24]:
#merge(fusionar)
#esta técnica fusiona diferentes df a partir de una columna (llave) en común

In [25]:
df= pd.DataFrame({"A":["1A","2A"],"B": ["1B","2B"],"C":["1C","2C"]})
df2= pd.DataFrame({"A":["1A","2A"],"B": ["1B","2B"],"C":["1C","2C"], "K":["1K","2K"]})

In [26]:
df

    A   B   C
0  1A  1B  1C
1  2A  2B  2C

In [27]:
df2

    A   B   C   K
0  1A  1B  1C  1K
1  2A  2B  2C  2K

In [30]:
pd.merge(df,df2, on=["A"]) #hay q especificar q columna queremos fusionar
#fusion a la derecha

    A B_x C_x B_y C_y   K
0  1A  1B  1C  1B  1C  1K
1  2A  2B  2C  2B  2C  2K

In [33]:
df= pd.DataFrame({"A":["1A","2A","3A"],"B": ["1B","2B","3B"]})
df2= pd.DataFrame({"A":["1A","2A"],"B": ["1B","2B"],"C":["1C","2C"], "K":["1K","2K"]})

In [35]:
pd.merge(df,df2, on=["A"], how="outer")

    A B_x  B_y    C    K
0  1A  1B   1B   1C   1K
1  2A  2B   2B   2C   2K
2  3A  3B  NaN  NaN  NaN

In [36]:
pd.merge(df,df2, on=["A"], how="left")

    A B_x  B_y    C    K
0  1A  1B   1B   1C   1K
1  2A  2B   2B   2C   2K
2  3A  3B  NaN  NaN  NaN

In [46]:
#join: solo combinas las columnas dek data frame indexado. tienen que tener diferentes columnas para agregarselas al dfg

In [44]:
df= pd.DataFrame({"Z":["1A","2A","3A"],"B": ["1B","2B","3B"]}, index=["i1","i2","i3"])
df2= pd.DataFrame({"A":["1A","2A"],"C":["1C","2C"], "K":["1K","2K"]},index=["i1","i2"])

In [45]:
df.join(df2)

     Z   B    A    C    K
i1  1A  1B   1A   1C   1K
i2  2A  2B   2A   2C   2K
i3  3A  3B  NaN  NaN  NaN

In [47]:
#podemos convertirlo a excel
df2.to_csv("df2.csv", index=False)

In [49]:
pd.read_csv(r"C:\Users\shade\OneDrive\Documents\GitHub\Neurociencias-2026-1\df2.csv")

    A   C   K
0  1A  1C  1K
1  2A  2C  2K